Repository: audrow/ros2_documentation
Catalog: locale/*/LC_MESSAGES/index.po
Languages: es

source: ROS 2 Documentation
es: Documentación de ROS 2

source: **The Robot Operating System (ROS) is a set of software libraries and tools for building robot applications.** From drivers and state-of-the-art algorithms to powerful developer tools, ROS has the open source tools you need for your next robotics project.
es: **Robot Operating System (ROS) es un conjunto de bibliotecas de software y herramientas para crear aplicaciones para robots.** Desde controladores y algoritmos de última generación hasta potentes herramientas para desarrolladores, ROS tiene las herramientas de código abierto que necesitas para tu próximo proyecto de robótica.

source: Since ROS was started in 2007, a lot has changed in the robotics and ROS community. The goal of the ROS 2 project is to adapt to these changes, leveraging what is great about ROS 1 and improving what isn’t.
es: Desde que se inició ROS en 2007, muchas cosas han cambiado en la comunidad de robótica y ROS. El objetivo del proyecto ROS 2 es adaptarse a estos cambios, aprovechando lo bueno de ROS 1 y mejorando lo que no lo es.

source: This site contains the documentation for ROS 2. If you are looking for ROS 1 documentation, check out the `ROS wiki <https://wiki.ros.org>`__.
es: Este sitio contiene la documentación para ROS 2. Si estás buscando documentación de ROS 1, consulta `ROS wiki <https://wiki.ros.org>`__.

source: If you use ROS 2 in your work, please see :doc:`Citations <Citations>` to cite ROS 2.
es: Si usas ROS 2 en tu trabajo, consulte :doc:`Citas <Citations>` para citar ROS 2.

source: Getting started
es: Empezando

source: :doc:`Installation <Installation>`
es: :doc:`Instalación <Installation>`

source: Instructions to set up ROS 2 for the first time
es: Instrucciones para configurar ROS 2 por primera vez

source: :doc:`Tutorials <Tutorials>`
es: :doc:`Tutoriales <Tutorials>`

source: The best place to start for new users!
es: ¡El mejor lugar para comenzar para los nuevos usuarios!

source: Hands-on sample projects that help you build a progression of necessary skills
es: Proyectos de muestra prácticos que lo ayudan a desarrollar una progresión de las habilidades necesarias

source: :doc:`How-To-Guides`
es: :doc:`Guías prácticas <How-To-Guides>`

source: Quick answers to your "How do I...?" questions without working through the :doc:`Tutorials <Tutorials>`
es: Respuestas rápidas a sus preguntas "¿Cómo hago para...?" sin ir a los :doc:`Tutoriales <Tutorials>`

source: :doc:`Concepts <Concepts>`
es: :doc:`Conceptos <Concepts>`

source: High-level explanations of core ROS 2 concepts covered in the :doc:`Tutorials <Tutorials>`
es: Explicaciones de alto nivel de los conceptos centrales de ROS 2 cubiertos en los :doc:`Tutoriales <Tutorials>`

source: :doc:`Contact <Contact>`
es: :doc:`Contacto <Contact>`

source: Answers to your questions or a forum to start a discussion
es: Respuestas a tus preguntas o un foro para iniciar una discusión.

source: The ROS 2 project
es: El proyecto ROS 2

source: If you're interested in the advancement of the ROS 2 project:
es: Si estás interesado en el avance del proyecto ROS 2:

source: :doc:`Contributing <The-ROS2-Project/Contributing>`
es: :doc:`Contribuir <The-ROS2-Project/Contributing>`

source: Best practices and methodology for contributing to ROS 2, as well as instructions for migrating existing ROS 1 content to ROS 2
es: Mejores prácticas y metodología para contribuir a ROS 2, así como instrucciones para migrar contenido existente de ROS 1 a ROS 2

source: :doc:`Distributions <Releases>`
es: :doc:`Distribuciones <Releases>`

source: Past, present and future ROS 2 distributions
es: Distribuciones pasadas, presentes y futuras de ROS 2

source: :doc:`Features Status <The-ROS2-Project/Features>`
es: :doc:`Estado de las características <The-ROS2-Project/Features>`

source: Features in the current release
es: Características de la versión actual

source: :doc:`Feature Ideas <The-ROS2-Project/Feature-Ideas>`
es: :doc:`Ideas de características <The-ROS2-Project/Feature-Ideas>`

source: Ideas for nice-to-have features that are not under active development
es: Ideas para características deseadas que no están en desarrollo activo

source: :doc:`Roadmap <The-ROS2-Project/Roadmap>`
es: :doc:`Hoja de ruta <The-ROS2-Project/Roadmap>`

source: Planned work for ROS 2 development
es: Trabajo planificado para el desarrollo de ROS 2

source: :doc:`ROSCon Talks <The-ROS2-Project/ROSCon-Content>`
es: :doc:`Charlas de ROSCon <The-ROS2-Project/ROSCon-Content>`

source: Presentations by the community on ROS 2
es: Presentaciones de la comunidad sobre ROS 2

source: :doc:`Project Governance <The-ROS2-Project/Governance>`
es: :doc:`Gobernanza del proyecto <The-ROS2-Project/Governance>`

source: Information about the ROS Technical Steering Committee, Working Groups, and upcoming events
es: Información sobre el Comité Directivo Técnico de ROS, los Grupos de Trabajo y los próximos eventos

source: Downloadable marketing materials
es: Materiales de marketing descargables

source: `Information about the ROS trademark <https://www.ros.org/blog/media/>`__
es: `Información sobre la marca comercial de ROS <https://www.ros.org/blog/media/>`__

source: ROS community resources
es: Recursos de la comunidad de ROS

source: If you need help, have an idea, or would like to contribute to the project, please visit our ROS community resources.
es: Si necesitas ayuda, tienes una idea o te gustaría contribuir al proyecto, por favor visita nuestros recursos de la comunidad ROS.

source: `Official ROS Discord Channel for discussion and support <https://discord.com/servers/open-robotics-1077825543698927656>`__ (ROS 1, ROS 2)
es: `Canal oficial de Discord de ROS para discusión y soporte <https://discord.com/servers/open-robotics-1077825543698927656>`__ (ROS 1, ROS 2)

source: `Robotics Stack Exchange - community Q&A website <https://robotics.stackexchange.com/>`__ (ROS 1, ROS 2)
es: `Robotics Stack Exchange - sitio web de preguntas y respuestas de la comunidad <https://robotics.stackexchange.com/>`__ (ROS 1, ROS 2)

source: See :ref:`Contact Page <Using Robotics Stack Exchange>` for more information
es: Ver :ref:`Página de contacto <Using Robotics Stack Exchange>` para más información

source: Forum for general discussions and announcements for the ROS community
es: Foro de debates generales y anuncios para la comunidad ROS

source: See the :ref:`Contact Page <Using ROS Discourse>` for more information
es: Ver :ref:`Página de contacto <Using ROS Discourse>` para más información

source: `ROS Index <https://index.ros.org/>`__ (ROS 1, ROS 2)
es: `Índice de ROS <https://index.ros.org/>`__ (ROS 1, ROS 2)

source: Indexed list of all packages (i.e. `Python Package Index (PyPI) <https://pypi.org/>`_ for ROS packages)
es: Lista indexada de todos los paquetes (es decir, `Python Package Index (PyPI) <https://pypi.org/>`_ para paquetes de ROS)

source: See which ROS distributions a package supports
es: Ver qué distribuciones de ROS admite un paquete

source: Link to a package's repository, API documentation, or website
es: Enlace al repositorio de un paquete, documentación de la API o sitio web

source: Inspect a package's license, build type, maintainers, status, and dependencies
es: Inspeccionar la licencia, el tipo de compilación, los mantenedores, el estado y las dependencias de un paquete

source: Get more info for a package on `ROS Answers <https://answers.ros.org/questions/>`__
es: Obtén más información sobre un paquete en `ROS Answers <https://answers.ros.org/questions/>`__

source: `ROS resource status page <https://status.openrobotics.org/>`__ (ROS 1, ROS 2)
es: `Página de estado de recursos ROS <https://status.openrobotics.org/>`__ (ROS 1, ROS 2)

source: Check the current status of ROS resources like Discourse or the ROS build farm.
es: Revisar el estado actual de los recursos de ROS como Discourse o la granja de construcción de ROS

source: General ROS project resources
es: Recursos generales del proyecto ROS

source: `ROS Enhancement Proposals (REPs) <https://ros.org/reps/rep-0000.html>`__ (ROS 1, ROS 2)
es: `Propuestas de mejora para ROS (REP) <https://ros.org/reps/rep-0000.html>`__ (ROS 1, ROS 2)

source: Proposals for new designs and conventions
es: Propuestas de nuevos diseños y convenciones

source: `ROS Robots <https://robots.ros.org/>`__ (ROS 1, ROS 2)
es: `Robots ROS <https://robots.ros.org/>`__ (ROS 1, ROS 2)

source: Showcases robots projects from the community
es: Muestras de proyectos de robots de la comunidad

source: Instructions on how to contribute a robot
es: Instrucciones sobre cómo contribuir con un robot

source: ROS 1 documentation and user modifiable content
es: Documentación de ROS 1 y contenido modificable por el usuario

source: Active until at least the last ROS 1 distribution is EOL
es: Activo hasta que al menos la última distribución de ROS 1 sea EOL

source: ROS 1 and ROS 2 product landing page, with high-level description of ROS and links to other ROS sites
es: Página de inicio de producto de ROS 1 y ROS 2, con descripción de alto nivel de ROS y enlaces a otros sitios de ROS

source: Events
es: Eventos

source: `Official ROS Vimeo Channel <https://vimeo.com/osrfoundation>`__ (ROS 1, ROS 2)
es: `Canal oficial de ROS en Vimeo <https://vimeo.com/osrfoundation>`__ (ROS 1, ROS 2)

source: Videos of ROSCon Talks, community and working group meetings, and project demos.
es: Videos de charla de ROSCon, reuniones de la comunidad o grupos de trabajo, y demostraciones de proyectos.

source: `ROSCon website <https://roscon.ros.org/>`__ (ROS 1, ROS 2)
es: `Sitio web de ROSCon <https://roscon.ros.org/>`__ (ROS 1, ROS 2)

source: ROSCon is our annual ROS developer conference.
es: ROSCon es nuestra conferencia anual de desarrolladores de ROS

source: This page also lists regional ROS events like ROSConJP and ROSConFr.
es: Esta página también lista los eventos regionales de ROS como ROSConJP o ROSConFr.

source: `Open Source Robotics Foundation official events calendar <https://calendar.google.com/calendar/u/0/embed?src=agf3kajirket8khktupm9go748@group.calendar.google.com&ctz=America/Los_Angeles>`__
es: `Calendario de eventos oficiales de la Open Source Robotics Foundation <https://calendar.google.com/calendar/u/0/embed?src=agf3kajirket8khktupm9go748@group.calendar.google.com&ctz=America/Los_Angeles>`__

source: This calendar is for official OSRF Events and working group meetings.
es: Este calendario es para eventos oficiales de la OSRF y reuniones de grupos de trabajo.

source: `Submit your events here <https://bit.ly/OSRFCalendarForm>`__.
es: `Envia tus eventos aquí <https://bit.ly/OSRFCalendarForm>`__.

source: `Open Source Robotics Foundation community calendar <https://calendar.google.com/calendar/embed?src=c_3fc5c4d6ece9d80d49f136c1dcd54d7f44e1acefdbe87228c92ff268e85e2ea0%40group.calendar.google.com&ctz=America%2FLos_Angeles>`__
es: `Calendario de la comunidad de la Open Source Robotics Foundation <https://calendar.google.com/calendar/embed?src=c_3fc5c4d6ece9d80d49f136c1dcd54d7f44e1acefdbe87228c92ff268e85e2ea0%40group.calendar.google.com&ctz=America%2FLos_Angeles>`__

source: This calendar is for unofficial ROS community events.
es: Este calendario es para eventos no oficiales de la comunidad de ROS

source: `Submit your events here <https://bit.ly/OSRFCommunityCalendar>`__ .
es: `Envía tus eventos aquí <https://bit.ly/OSRFCommunityCalendar>`__

source: Miscellaneous
es: Misceláneo

source: `Purchase official ROS swag <https://spring.ros.org/>`__
es: `Compra productos oficiales de ROS <https://spring.ros.org/>`__

source: ROS on social media
es: ROS en redes sociales

source: `@OpenRoboticsOrg <https://twitter.com/OpenRoboticsOrg>`__ and `@ROSOrg <https://twitter.com/ROSOrg>`__ on Twitter
es: `@OpenRoboticsOrg <https://twitter.com/OpenRoboticsOrg>`__ y `@ROSOrg <https://twitter.com/ROSOrg>`__ en Twitter

source: `Open Robotics on LinkedIn <https://www.linkedin.com/company/open-source-robotics-foundation>`__
es: `Open Robotics en LinkedIn <https://www.linkedin.com/company/open-source-robotics-foundation>`__

source: Visit the `Open Source Robotics Foundation website <https://www.openrobotics.org/>`__
es: Visitar la `página web de la Open Source Robotics Foundation <https://www.openrobotics.org/>`__

source: Tax deductible charitable donations to the Open Source Robotics Foundation can be sent via `DonorBox. <https://donorbox.org/support-open-robotics?utm_medium=qrcode&utm_source=qrcode>`__
es: Las donaciones caritativas deducibles de impuestos a la Open Source Robotics Foundation se pueden realizar a través de `DonorBox. <https://donorbox.org/support-open-robotics?utm_medium=qrcode&utm_source=qrcode>`__

source: Deprecated
es: Obsoleto

source: ROS Answers was the ROS community Q&A website, until August, 2023. ROS Answers is currently available as a read-only resource.
es: ROS Answers fue el sitio web de preguntas y respuestas de la comunidad ROS, hasta agosto de 2023. Actualmente, ROS Answers está disponible como un recurso de solo lectura

source: API documentation up to and including Galactic
es: Documentación de API hasta e incluyendo Galactic

source: Early design decisions behind ROS 2 development
es: Decisiones iniciales de diseño detrás del desarrollo de ROS 2

source: New design proposals should be submitted via `ROS Enhancement Proposals (REPs) <https://ros.org/reps/rep-0000.html>`__
es: Nuevas propuestas de diseño deben ser enviadas vía `ROS Enhancement Proposals (REPs) <https://ros.org/reps/rep-0000.html>`__
