Repository: audrow/ros2_documentation
Catalog: locale/*/LC_MESSAGES/The-ROS2-Project/Contributing/Code-Style-Language-Versions.po
Languages: es

source: The following rules to format text is intended to increase readability as well as versioning.
es: *[Solo .rst]* En el texto reStructured, los encabezados deben seguir la jerarquía descrita en la `guía de estilo de Sphinx <https://documentation-style-guide-sphinx.readthedocs.io/en/latest/style-guide.html#headings>`__:

source: *[.md, .rst only]* Each section title should be preceded by one empty line and succeeded by one empty line.
es: ``#`` con línea superior (solo una vez, se usa para el título del documento)

source: Rationale: It expedites to get an overview about the structure when screening the document.
es: ``*`` con sobrelínea

source: Rationale: A consistent hierarchy expedites getting an idea about the nesting level when screening the document.
es: Se debe usar un espacio entre los hash y el título del encabezado (como ``# Heading 1``) para que sea más fácil separarlos visualmente.

source: *[.md only]* In Markdown the headings should follow the ATX-style described in the `Markdown syntax documentation <https://daringfireball.net/projects/markdown/syntax#header>`__
es: La justificación de la preferencia del estilo ATX proviene de la `guía de estilo de Google Markdown <https://github.com/google/styleguide/blob/gh-pages/docguide/style.md#atx-style-headings>`__

source: ATX-style headers use 1-6 hash characters (``#``) at the start of the line to denote header levels 1-6.
es: Justificación: los encabezados de estilo ATX son más fáciles de buscar y mantener, y hacen que los dos primeros niveles de encabezado sean coherentes con los otros niveles.

source: A space between the hashes and the header title should be used (such as ``# Heading 1``) to make it easier to visually separate them.
es: *[cualquiera]* Cada oración debe comenzar en una nueva línea.

source: Justification for the ATX-style preference comes from the `Google Markdown style guide <https://github.com/google/styleguide/blob/gh-pages/docguide/style.md#atx-style-headings>`__
es: Justificación: para párrafos más largos, un solo cambio al principio hace que la diferencia sea ilegible, ya que continúa a lo largo de todo el párrafo.

source: Rationale: ATX-style headers are easier to search and maintain, and make the first two header levels consistent with the other levels.
es: *[cualquiera]* Opcionalmente, cada oración se puede envolver para que cada línea sea corta.

source: *[any]* Each sentence must start on a new line.
es: *[cualquiera]* Las líneas no deben tener ningún espacio en blanco al final.

source: Rationale: For longer paragraphs a single change in the beginning makes the diff unreadable since it carries forward through the whole paragraph.
es: *[.md, .rst solamente]* Un bloque de código debe estar precedido y seguido por una línea vacía.

source: *[any]* Each sentence can optionally be wrapped to keep each line short.
es: Justificación: los espacios en blanco son significativos solo directamente antes y después de los bloques de código delimitados. Seguir estas instrucciones asegurará que el resaltado funcione de manera adecuada y consistente.

source: *[any]* The lines should not have any trailing white spaces.
es: *[.md, .rst solamente]* Un bloque de código debe especificar una sintaxis (por ejemplo, ``bash``).
