Repository: audrow/ros2_documentation
Catalog: locale/*/LC_MESSAGES/The-ROS2-Project/Contributing/Code-Style-Language-Versions.po
Languages: es

source: Code style and language versions
es: Estilo de código y versiones de lenguaje

source: Table of Contents
es: Tabla de Contenido

source: In order to achieve a consistent looking product we will all follow externally (if possible) defined style guidelines for each language. For other things like package layout or documentation layout we will need to come up with our own guidelines, drawing on current, popular styles in use now.
es: Para lograr un producto de apariencia consistente, todos seguiremos para cada lenguaje de programación guías de estilo (de ser posible) que ya estén definidas externamente. Para otras cosas, como el diseño de paquetes o el diseño de la documentación, necesitaremos crear nuestras propias pautas, basándonos en los estilos actuales y populares que se usan ahora.

source: Additionally, wherever possible, developers should use integrated tools to allow them to check that these guidelines are followed in their editors. For example, everyone should have a PEP8 checker built into their editor to cut down on review iterations related to style.
es: Además, siempre que sea posible, los desarrolladores deben usar herramientas integradas que les permitan verificar que se sigan estas pautas en sus editores. Por ejemplo, todos deberían tener un verificador PEP8 integrado en su editor para reducir las iteraciones de revisión relacionadas con el estilo.

source: Also where possible, packages should check style as part of their unit tests to help with the automated detection of style issues (see `ament_lint_auto <https://github.com/ament/ament_lint/blob/rolling/ament_lint_auto/doc/index.rst>`__).
es: Además, cuando sea posible, los paquetes deben verificar el estilo como parte de sus pruebas unitarias para ayudar con la detección automática de problemas de estilo (ver `ament_lint_auto <https://github.com/ament/ament_lint/blob/rolling/ament_lint_auto/doc/index.rst>`__).

source: Standard
es: Estándar

source: We will target C99.
es: Se apunta a C99.

source: Style
es: Estilo

source: We will use `Python's PEP7 <https://www.python.org/dev/peps/pep-0007/>`__ for our C style guide, with some modifications and additions:
es: Usaremos `Python's PEP7 <https://www.python.org/dev/peps/pep-0007/>`__ para nuestra guía de estilo C, con algunas modificaciones y adiciones:

source: We will target C99, as we do not need to support C89 (as PEP7 recommends)
es: Apuntamos a C99, ya que no necesitamos admitir C89 (como recomienda PEP7)

source: rationale: among other things it allows us to use both ``//`` and ``/* */`` style comments
es: justificación: entre otras cosas, nos permite usar comentarios de estilo ``//`` y ``/* */``

source: rationale: C99 is pretty much ubiquitous now
es: justificación: C99 es bastante omnipresente ahora

source: C++ style ``//`` comments are allowed
es: Se permiten comentarios estilo C++ ``//``

source: (optional) Always place literals on the left-hand side of comparison operators, e.g. ``0 == ret`` instead of ``ret == 0``
es: (opcional) Coloque siempre los literales en el lado izquierdo de los operadores de comparación, por ejemplo, ``0 == ret`` en lugar de ``ret == 0``

source: rationale: ``ret == 0`` too easily turns into ``ret = 0`` by accident
es: justificación: ``ret == 0`` puede convertirse en fácilmente ``ret = 0`` por accidente

source: optional because when using ``-Wall`` (or equivalent) modern compilers will warn you when this happens
es: opcional porque al usar ``-Wall`` (o equivalente) los compiladores modernos le avisarán cuando esto suceda

source: All of the following modifications only apply if we are not writing Python modules:
es: Todas las siguientes modificaciones solo se aplican si no se esta escribiendo módulos de Python:

source: Do not use ``Py_`` as a prefix for everything
es: No use ``Py_`` como prefijo para todo

source: instead use a CamelCase version of the package name or other appropriate prefix
es: en su lugar, use una versión CamelCase del nombre del paquete u otro prefijo apropiado

source: The stuff about documentation strings doesn't apply
es: las cosas sobre documentación de strings no se aplica

source: We can use the `pep7 <https://github.com/mike-perdide/pep7>`__ python module for style checking. The editor integration seems slim, we may need to look into automated checking for C in more detail.
es: Podemos usar el módulo de python `pep7 <https://github.com/mike-perdide/pep7>`__ para verificación de estilo. La integración del editor parece escasa, es posible que debamos analizar la verificación automática de C con más detalle.

source: Rolling targets C++17.
es: Rolling toma como referencia a C++17.

source: We will use the `Google C++ Style Guide <https://google.github.io/styleguide/cppguide.html>`__, with some modifications:
es: Usaremos la Guía de estilo de `Google C++ Style Guide <https://google.github.io/styleguide/cppguide.html>`__, con algunas modificaciones:

source: Line Length
es: Longitud de la línea

source: Our maximum line length is 100 characters.
es: Nuestra longitud máxima de línea es de 100 caracteres.

source: File Extensions
es: Extensiones de archivo

source: Header files should use the .hpp extension.
es: Los archivos de encabezado deben usar la extensión .hpp.

source: rationale: Allow tools to determine content of files, C++ or C.
es: justificación: permitir que las herramientas determinen el contenido de los archivos, C++ o C.

source: Implementation files should use the .cpp extension.
es: Los archivos de implementación deben usar la extensión .cpp.

source: Variable Naming
es: Nomenclatura de variables

source: For global variables use lowercase with underscores prefixed with ``g_``
es: Para variables globales, use minúsculas con guiones bajos con el prefijo ``g_``

source: rationale: keep variable naming case consistent across the project
es: justificación: mantener la coherencia entre mayúsculas y minúsculas en todo el proyecto

source: rationale: easy to tell the scope of a variable at a glance
es: justificación: es fácil saber el alcance de una variable de un vistazo

source: consistency across languages
es: coherencia entre lenguajes

source: Function and Method Naming
es: Denominación de funciones y métodos

source: Google style guide says ``CamelCase``, but the C++ std library's style of ``snake_case`` is also allowed
es: La guía de estilo de Google dice ``CamelCase``, pero también se permite el estilo ``snake_case`` de la biblioteca estándar de C++

source: rationale: ROS 2 core packages currently use ``snake_case``
es: justificación: los paquetes principales de ROS 2 actualmente usan ``snake_case``

source: reason: either an historical oversight or a personal preference that didn't get checked by the linter
es: razón: ya sea un descuido histórico o una preferencia personal que no fue verificada por el linter

source: reason for not changing: retroactively changing would be too disruptive
es: razón para no cambiar: cambiar retroactivamente sería demasiado disruptivo

source: other considerations:
es: Otras Consideraciones:

source: ``cpplint.py`` does not check this case (hard to enforce other than with review)
es: ``cpplint.py`` no verifica este caso (difícil de hacer cumplir excepto con revisión)

source: ``snake_case`` can result in more consistency across languages
es: ``snake_case`` puede dar como resultado una mayor coherencia entre lenguajes

source: specific guidance:
es: orientación específica:

source: for existing projects, prefer the existing style
es: para proyectos existentes, se prefiere el estilo existente

source: for new projects, either is acceptable, but a preference for matching related existing projects is advised
es: para nuevos proyectos, cualquiera de los dos es aceptable, pero se recomienda una preferencia por la coincidencia de proyectos existentes relacionados

source: final decision is always developer discretion
es: la decisión final es siempre discreción del desarrollador

source: special cases like function pointers, callable types, etc. may require bending the rules
es: casos especiales como punteros de función, tipos invocables, etc. pueden requerir doblar las reglas

source: Note that classes should still use ``CamelCase`` by default
es: Tenga en cuenta que las clases aún deben usar ``CamelCase`` por defecto

source: Access Control
es: Control de acceso

source: Drop requirement for all class members to be private and therefore require accessors
es: Elimina el requisito de que todos los miembros de la clase sean privados y, por lo tanto, requieran accessors

source: rationale: this is overly constraining for user API design
es: justificación: esto es demasiado restrictivo para el diseño de API de usuario

source: we should prefer private members, only making them public when they are needed
es: debemos preferir miembros privados, solo haciéndolos públicos cuando sean necesarios

source: we should consider using accessors before choosing to allow direct member access
es: debemos considerar el uso de accessors antes de elegir permitir el acceso directo a los miembros

source: we should have a good reason for allowing direct member access, other than because it is convenient for us
es: debemos tener una buena razón para permitir el acceso directo de los miembros, que sea conveniente para nosotros no es razón suficiente.

source: Exceptions
es: Excepciones

source: Exceptions are allowed
es: Se permiten excepciones

source: rationale: this is a new codebase, so the legacy argument doesn't apply to us
es: justificación: esta es una nueva base de código, por lo que el argumento heredado no se aplica a nosotros

source: rationale: for user-facing API's it is more idiomatic C++ to have exceptions
es: justificación: para las API orientadas al usuario, es más idiomático C++ tener excepciones

source: Exceptions in destructors should be explicitly avoided
es: Las excepciones en los destructores deben evitarse explícitamente

source: We should consider avoiding Exceptions if we intend to wrap the resulting API in C
es: Debemos considerar evitar Excepciones si tenemos la intención de envolver la API resultante en C

source: rationale: it will make it easier to wrap in C
es: justificación: hará que sea más fácil envolver en C

source: rationale: most of our dependencies in code we intend to wrap in C do not use exceptions anyways
es: justificación: la mayoría de nuestras dependencias en el código que pretendemos envolver en C no usan excepciones de todos modos

source: Function-like Objects
es: Objetos similares a funciones

source: No restrictions on Lambda's or ``std::function`` or ``std::bind``
es: Sin restricciones en Lambda's o ``std::function`` o ``std::bind``

source: Boost should be avoided unless absolutely required.
es: Boost debe evitarse a menos que sea absolutamente necesario.

source: Comments and Doc Comments
es: Comentarios y comentarios del documento

source: Use ``///`` and ``/** */`` comments for *documentation* purposes and ``//`` style comments for notes and general comments
es: Utilice los comentarios ``///`` y ``/** */`` para propósitos de *documentación* y comentarios de estilo ``//`` para notas y comentarios generales

source: Class and Function comments should use ``///`` and ``/** */`` style comments
es: Los comentarios de clase y función deben usar comentarios de estilo ``///`` y ``/** */``

source: rationale: these are recommended for Doxygen and Sphinx in C/C++
es: justificación: se recomiendan para Doxygen y Sphinx en C/C++

source: rationale: mixing ``/* */`` and ``//`` is convenient for block commenting out code which contains comments
es: justificación: mezclar ``/* */`` y ``//`` es conveniente para comentar bloques de código que contengan comentarios

source: Descriptions of how the code works or notes within classes and functions should use ``//`` style comments
es: Las descripciones de cómo funciona el código o las notas dentro de las clases y funciones deben usar comentarios de estilo ``//``

source: Pointer Syntax Alignment
es: Alineación de sintaxis de puntero

source: Use ``char * c;`` instead of ``char* c;`` or ``char *c;`` because of this scenario ``char* c, *d, *e;``
es: Use ``char * c;`` en lugar de ``char* c;`` o ``char *c;`` debido a este escenario ``char* c, *d, *e;``

source: Class Privacy Keywords
es: Palabras clave de privacidad de clase

source: Do not put 1 space before ``public:``, ``private:``, or ``protected:``, it is more consistent for all indentions to be a multiple of 2
es: No coloque 1 espacio antes de ``public:``, ``private:`` o ``protected:``, es más consistente que todas las sangrías sean múltiplos de 2

source: rationale: most editors don't like indentions which are not a multiple of the (soft) tab size
es: justificación: a la mayoría de los editores no les gustan las sangrías que no son un múltiplo del tamaño de la pestaña (suave)

source: Use zero spaces before ``public:``, ``private:``, or ``protected:``, or 2 spaces
es: Usa cero espacios antes de ``public:``, ``private:``, o ``protected:``, o 2 espacios

source: If you use 2 spaces before, indent other class statements by 2 additional spaces
es: Si usa 2 espacios antes, indenta otras declaraciones de clase con 2 espacios adicionales

source: Prefer zero spaces, i.e. ``public:``, ``private:``, or ``protected:`` in the same column as the class
es: Se prefiere cero espacios, es decir, ``public:``, ``private:`` o ``protected:`` en la misma columna que la clase

source: Nested Templates
es: Plantillas anidadas

source: Never add whitespace to nested templates
es: Nunca agregue espacios en blanco a las plantillas anidadas

source: Prefer ``set<list<string>>`` (C++11 feature) to ``set<list<string> >`` or ``set< list<string> >``
es: Se prefiere ``set<list<string>>`` (característica de C++11 ) a ``set<list<string> >`` o ``set< list<string> >``

source: Always Use Braces
es: Paréntesis abiertos Versus Cuddled

source: Always use braces following ``if``, ``else``, ``do``, ``while``, and ``for``, even when the body is a single line.
es: Usa paréntesis en una nueva linea para ``function``, ``class``, ``enum``, y ``struct``, pero paréntesis en la misma linea para ``if``, ``else``, ``while``, ``for``, etc...

source: rationale: less opportunity for visual ambiguity and for complications due to use of macros in the body
es: Excepción: cuando un ``if`` (o ``while``, etc.) es lo suficiente largo que no quepa en linea, entonces usar nueva linea (i.e., don't cuddle).

source: Open Versus Cuddled Braces
es: Cuando una llamada a una función no quepa en una linea, rompe la linea (no entre argumentos) y empieza en la proxima linea con indentación de 2 espacios. Si se tienen más argumentos continua con la indentación de 2 espacios en las lineas siguientes . (Nota que la `Guía de estilos de Google <https://google.github.io/styleguide/cppguide.html#Function_Calls>`__ se autocontradice en este punto.)

source: Use open braces for ``function``, ``class``, ``enum``, and ``struct`` definitions, but cuddle braces on ``if``, ``else``, ``while``, ``for``, etc...
es: Lo mismo se aplica a ``if`` (y ``while``, etc.) si son demasiado largas para caber en una linea.

source: Exception: when an ``if`` (or ``while``, etc.) condition is long enough to require line-wrapping, then use an open brace (i.e., don't cuddle).
es: Ejemplos

source: When a function call cannot fit on one line, wrap at the open parenthesis (not in between arguments) and start them on the next line with a 2-space indent. Continue with the 2-space indent on subsequent lines for more arguments. (Note that the `Google style guide <https://google.github.io/styleguide/cppguide.html#Function_Calls>`__ is internally contradictory on this point.)
es: Esto esta OK:

source: Same goes for ``if`` (and ``while``, etc.) conditions that are too long to fit on one line.
es: Esto **no** esta bien:

source: Examples
es: Usa corchetes abierto en lugar de usar sangria de manera excesiva, p.ej. para distinguir el código del constructor de las listas de inicializadores del constructor

source: This is OK:
es: Esto **no** está bien, incluso es extraño (¿a la manera de Google?):

source: This is **not** OK:
es: Linters

source: Use open braces rather than excessive indention, e.g. for distinguishing constructor code from constructor initializer lists
es: El estilo fue verificado con una combinación de `cpplint.py <https://github.com/google/styleguide>`__ de Google y `uncrustify <https://github.com/uncrustify/uncrustify>`__.

source: This is **not** OK, even weird (the google way?):
es: Proporcionamos herramientas de linea de comandos con las configuraciones personalizada:

source: Linters
es: `ament_clang_format <https://github.com/ament/ament_lint/blob/rolling/ament_clang_format/doc/index.rst>`__: `configuration <https://github.com/ament/ament_lint/blob/rolling/ament_clang_format/ament_clang_format/configuration/.clang-format>`__

source: We check these styles with a combination of Google's `cpplint.py <https://github.com/google/styleguide>`__ and `uncrustify <https://github.com/uncrustify/uncrustify>`__.
es: `ament_cpplint <https://github.com/ament/ament_lint/blob/rolling/ament_cpplint/doc/index.rst>`__

source: We provide command line tools with custom configurations:
es: `ament_uncrustify <https://github.com/ament/ament_lint/blob/rolling/ament_uncrustify/doc/index.rst>`__: `configuration <https://github.com/ament/ament_lint/blob/rolling/ament_uncrustify/ament_uncrustify/configuration/ament_code_style.cfg>`__

source: `ament_clang_format <https://github.com/ament/ament_lint/blob/rolling/ament_clang_format/doc/index.rst>`__: `configuration <https://github.com/ament/ament_lint/blob/rolling/ament_clang_format/ament_clang_format/configuration/.clang-format>`__
es: Algunos correctores de estilo como ament_uncrustify y ament_clang_format tienen la opción ``--reformat`` para aplicar los cambios.

source: `ament_cpplint <https://github.com/ament/ament_lint/blob/rolling/ament_cpplint/doc/index.rst>`__
es: También ejecutamos otras herramientas para detectar y eliminar tantas advertencias como sea posible. Aquí hay una lista no exhaustiva de cosas adicionales que tratamos de hacer en todos nuestros paquetes:

source: `ament_uncrustify <https://github.com/ament/ament_lint/blob/rolling/ament_uncrustify/doc/index.rst>`__: `configuration <https://github.com/ament/ament_lint/blob/rolling/ament_uncrustify/ament_uncrustify/configuration/ament_code_style.cfg>`__
es: usar banderas del compilador como ``-Wall -Wextra -Wpedantic``

source: Some formatters such as ament_uncrustify and ament_clang_format support ``--reformat`` options to apply changes in place.
es: ejecutar análisis de código estático como ``cppcheck``, que hemos integrado en `ament_cppcheck <https://github.com/ament/ament_lint/blob/rolling/ament_cppcheck/doc/index.rst>`__.

source: We also run other tools to detect and eliminate as many warnings as possible. Here's a non-exhaustive list of additional things we try to do on all of our packages:
es: Python

source: use compiler flags like ``-Wall -Wextra -Wpedantic``
es: Versión

source: run static code analysis like ``cppcheck``, which we have integrated in `ament_cppcheck <https://github.com/ament/ament_lint/blob/rolling/ament_cppcheck/doc/index.rst>`__.
es: Apuntaremos a Python 3 para nuestro desarrollo.

source: Python
es: Usaremos las `directrices de PEP8 <https://www.python.org/dev/peps/pep-0008/>`__ para el formato del código.

source: Version
es: Elegimos la siguiente regla más precisa donde PEP 8 deja cierta libertad:

source: We will target Python 3 for our development.
es: `Permitimos hasta 100 caracteres por línea (quinto párrafo) <https://www.python.org/dev/peps/pep-0008/#maximum-line-length>`__.

source: We will use the `PEP8 guidelines <https://www.python.org/dev/peps/pep-0008/>`_ for code format.
es: `Elegimos comillas simples sobre comillas dobles siempre que no sea necesario escapar <https://www.python.org/dev/peps/pep-0008/#string-quotes>`__.

source: We chose the following more precise rule where PEP 8 leaves some freedom:
es: `Preferimos sangrías colgantes para las líneas de continuación <https://www.python.org/dev/peps/pep-0008/#indentation>`__.

source: `We allow up to 100 characters per line (fifth paragraph) <https://www.python.org/dev/peps/pep-0008/#maximum-line-length>`_.
es: Las herramientas como el paquete de Python ``(ament_)pycodestyle`` deben usarse en la integración de pruebas unitarias y/o editores para comprobar el estilo del código de Python.

source: `We pick single quotes over double quotes as long as no escaping is necessary <https://www.python.org/dev/peps/pep-0008/#string-quotes>`_.
es: La configuración de pycodestyle utilizada en el linter está `aquí <https://github.com/ament/ament_lint/blob/rolling/ament_pycodestyle/ament_pycodestyle/configuration/ament_pycodestyle.ini>`__.

source: `We prefer hanging indents for continuation lines <https://www.python.org/dev/peps/pep-0008/#indentation>`_.
es: Integración con editores:

source: Tools like the ``(ament_)pycodestyle`` Python package should be used in unit-test and/or editor integration for checking Python code style.
es: atom: https://atom.io/packages/linter-pycodestyle

source: The pycodestyle configuration used in the linter is `here <https://github.com/ament/ament_lint/blob/rolling/ament_pycodestyle/ament_pycodestyle/configuration/ament_pycodestyle.ini>`__.
es: emacs: https://www.emacswiki.org/emacs/PythonProgrammingInEmacs

source: Integration with editors:
es: Sublime Text: https://sublime.wbond.net/packages/SublimeLinter-flake8

source: atom: https://atom.io/packages/linter-pycodestyle
es: vim: https://github.com/nvie/vim-flake8

source: emacs: https://www.emacswiki.org/emacs/PythonProgrammingInEmacs
es: CMake

source: Sublime Text: https://sublime.wbond.net/packages/SublimeLinter-flake8
es: Apuntaremos a CMake 3.8.

source: vim: https://github.com/nvie/vim-flake8
es: Dado que no existe una guía de estilo de CMake, definiremos la nuestra:

source: CMake
es: Usa nombres de comando en minúsculas (``find_package``, no ``FIND_PACKAGE``).

source: We will target CMake 3.8.
es: Usa identificadores ``snake_case`` (variables, funciones, macros).

source: Since there is not an existing CMake style guide we will define our own:
es: Utiliza los comandos vacíos ``else()`` y ``end...()``.

source: Use lowercase command names (``find_package``, not ``FIND_PACKAGE``).
es: Sin espacios en blanco antes de ``(``\ 's.

source: Use ``snake_case`` identifiers (variables, functions, macros).
es: Usa dos espacios de sangría, no use tabulaciones.

source: Use empty ``else()`` and ``end...()`` commands.
es: No uses sangría alineada para parámetros de invocaciones de macros de varias líneas. Use dos espacios solamente.

source: No whitespace before ``(``\ 's.
es: Se Preferiré funciones con ``set(PARENT_SCOPE)`` a macros.

source: Use two spaces of indention, do not use tabs.
es: Al usar macros prefija las variables locales con ``_`` o un prefijo razonable.

source: Do not use aligned indentation for parameters of multi-line macro invocations. Use two spaces only.
es: Markdown / reStructured Text / docblocks

source: Prefer functions with ``set(PARENT_SCOPE)`` to macros.
es: Las siguientes reglas para dar formato al texto están destinadas a aumentar la legibilidad, así como el control de versiones.

source: When using macros prefix local variables with ``_`` or a reasonable prefix.
es: *[.md, .rst solamente]* Cada título de sección debe estar precedido por una línea vacía y seguido por una línea vacía.

source: Markdown / reStructured Text / docblocks
es: Justificación: Es rápido obtener una visión general de la estructura al examinar el documento.
