Repository: audrow/ros2_documentation
Catalog: locale/*/LC_MESSAGES/The-ROS2-Project/Contributing/Quality-Guide.po
Languages: es

source: Quality guide: ensuring code quality
es: Guía de calidad: garantizar la calidad del código

source: Table of Contents
es: Tabla de Contenido

source: The sections below intend to address ROS 2 core, application and ecosystem packages and the core client libraries, C++ and Python. The solutions presented are motivated by design and implementation considerations to improve quality attributes like "Reliability", "Security", "Maintainability", "Determinism", etc. which relate to non-functional requirements.
es: Las siguientes secciones pretenden abordar los paquetes básicos, de aplicaciones y de ecosistemas de ROS 2 y las bibliotecas principales de clientes, C++ y Python. Las soluciones presentadas están motivadas por consideraciones de diseño e implementación para mejorar atributos de calidad como "Confiabilidad", "Seguridad", "Mantenibilidad", "Determinismo", etc. que se relacionan con requisitos no funcionales.

source: Static code analysis as part of the ament package build
es: Análisis de código estático como parte de la compilación del paquete ament

source: **Context**:
es: **Contexto**:

source: You have developed your C++ production code.
es: Has desarrollado tu código de producción C++.

source: You have created a ROS 2 package with build support with ``ament``.
es: Has creado un paquete ROS 2 con soporte de compilación con ``ament``.

source: **Problem**:
es: **Problema**:

source: Library level static code analysis is not run as part of the package build procedure.
es: El análisis de código estático a nivel de biblioteca no se ejecuta como parte del procedimiento de creación del paquete.

source: Library level static code analysis needs to be executed manually.
es: El análisis de código estático a nivel de biblioteca debe ejecutarse manualmente.

source: Risk of forgetting to execute library level static code analysis before building a new package version.
es: Riesgo de olvidarse de ejecutar el análisis de código estático a nivel de biblioteca antes de construir una nueva versión del paquete.

source: **Solution**:
es: **Solución**:

source: Use the integration capabilities of ``ament`` to execute static code analysis as part of the package build procedure.
es: Usa las capacidades de integración de ``ament`` para ejecutar análisis de código estático como parte del procedimiento de construcción del paquete.

source: **Implementation**:
es: **Implementación**:

source: Insert the ``ament_lint`` test dependencies into the packages ``package.xml`` file.
es: Inserta las dependencias de prueba ``ament_lint`` en el archivo ``package.xml`` de los paquetes.

source: **Examples**:
es: **Ejemplos**:

source: **Resulting context**:
es: **Contexto resultante**:

source: The static code analysis tools supported by ``ament`` are run as part of the package build.
es: Las herramientas de análisis de código estático soportadas por ``ament`` se ejecutan como parte de la construcción del paquete.

source: Static code analysis tools not supported by ``ament`` need to be executed separately.
es: Las herramientas de análisis de código estático que no son compatibles con ``ament`` deben ejecutarse por separado.

source: Static Thread Safety Analysis via Code Annotation
es: Análisis estático de seguridad de hilos a través de la anotación de código

source: **Context:**
es: **Contexto:**

source: You are developing/debugging your multithreaded C++ production code
es: Estás desarrollando/depurando tu código de producción C++ multihilo

source: You access data from multiple threads in C++ code
es: Accedes a datos de múltiples hilos en código C++

source: **Problem:**
es: **Problema:**

source: Data races and deadlocks can lead to critical bugs.
es: Las carreras de datos y los interbloqueos pueden provocar errores críticos.

source: **Solution:**
es: **Solución:**

source: Utilize Clang's static `Thread Safety Analysis <https://clang.llvm.org/docs/ThreadSafetyAnalysis.html>`__ by annotating threaded code
es: Utiliza el `Análisis de seguridad de hilos estático de Clang <https://clang.llvm.org/docs/ThreadSafetyAnalysis.html>`__ al anotar el código de subproceso

source: **Context For Implementation:**
es: **Contexto para la implementación:**

source: To enable Thread Safety Analysis, code must be annotated to let the compiler know more about the semantics of the code. These annotations are Clang-specific attributes - e.g. ``__attribute__(capability()))``. Instead of using those attributes directly, ROS 2 provides preprocessor macros that are erased when using other compilers.
es: Para habilitar el Análisis de Seguridad de hilos, se debe anotar el código para que el compilador sepa más sobre la semántica del código. Estas anotaciones son atributos específicos de Clang, p. ``__atributo__(capacidad()))``. En lugar de usar esos atributos directamente, ROS 2 proporciona macros de preprocesador que se borran cuando se usan otros compiladores.

source: These macros can be found in `rcpputils/thread_safety_annotations.hpp <https://github.com/ros2/rcpputils/blob/rolling/include/rcpputils/thread_safety_annotations.hpp>`__
es: Estas macros se pueden encontrar en `rcpputils/thread_safety_annotations.hpp <https://github.com/ros2/rcpputils/blob/rolling/include/rcpputils/thread_safety_annotations.hpp>`__

source: The Thread Safety Analysis documentation states
es: La documentación del análisis de seguridad de hilos establece

source: Thread safety analysis can be used with any threading library, but it does require that the threading API be wrapped in classes and methods which have the appropriate annotations
es: El análisis de seguridad de hilos se puede usar con cualquier biblioteca de hilos, pero requiere que la API de hilos se incluya en clases y métodos que tengan las anotaciones adecuadas.

source: We have decided that we want ROS 2 developers to be able to use ``std::`` threading primitives directly for their development. We do not want to provide our own wrapped types as is suggested above.
es: Hemos decidido que queremos que los desarrolladores de ROS 2 puedan usar primitivas de subprocesamiento ``std::`` directamente para su desarrollo. No queremos proporcionar nuestros propios tipos envueltos como se sugiere anteriormente.

source: There are three C++ standard libraries to be aware of
es: Hay tres bibliotecas estándar de C++ a tener en cuenta

source: The GNU standard library ``libstdc++`` - default on Linux, explicitly via the compiler option ``-stdlib=libstdc++``
es: La biblioteca estándar GNU ``libstdc++``: predeterminada en Linux, explícitamente a través de la opción del compilador ``-stdlib=libstdc++``

source: The LLVM standard library ``libc++`` (also called ``libcxx`` ) - default on macOS, explicitly set by the compiler option ``-stdlib=libc++``
es: La biblioteca estándar LLVM ``libc++`` (también llamada ``libcxx``) - predeterminada en macOS, establecida explícitamente por la opción del compilador ``-stdlib=libc++``

source: The Windows C++ Standard Library - not relevant to this use case
es: La biblioteca estándar de Windows C++: no es relevante para este caso de uso

source: ``libcxx`` annotates its ``std::mutex`` and ``std::lock_guard`` implementations for Thread Safety Analysis. When using GNU ``libstdc++`` , those annotations are not present, so Thread Safety Analysis cannot be used on non-wrapped ``std::`` types.
es: ``libcxx`` anota sus implementaciones ``std::mutex`` y ``std::lock_guard`` para el análisis de seguridad de hilos. Cuando se usa GNU ``libstdc++`` , esas anotaciones no están presentes, por lo que el análisis de seguridad de hilos no se puede usar en tipos ``std::`` no encapsulados.

source: *Therefore, to use Thread Safety Analysis directly with* ``std::`` *types, we must use* ``libcxx``
es: *Por lo tanto, para usar Thread Safety Analysis directamente con tipos* ``std::`` *, debemos usar* ``libcxx``

source: **Implementation:**
es: **Implementación:**

source: The code migration suggestions here are by no means complete - when writing (or annotating existing) threaded code, you are encouraged to utilize as many of the annotations as is logical for your use case. However, this step-by-step is a great place to start!
es: Las sugerencias de migración de código aquí de ninguna manera están completas - al escribir (o anotar las existentes) código multihilo, se te recomienda a utilizar tantas anotaciones como sea lógico para tu caso de uso. Sin embargo, ¡este paso a paso es un gran lugar para comenzar!

source: Enabling Analysis for Package/Target
es: Habilitación de análisis para paquete/objetivo

source: When the C++ compiler is Clang, enable the ``-Wthread-safety`` flag. Example below for CMake-based projects
es: Cuando el compilador de C++ es Clang, habilite el indicador ``-Wthread-safety``. Ejemplo a continuación para proyectos basados en CMake

source: Annotating Code
es: Código de anotación

source: Step 1 - Annotate data members
es: Paso 1 - Anotar miembros de datos

source: Find anywhere that ``std::mutex`` is used to protect some member data
es: Encuentre en cualquier lugar que ``std::mutex`` se use para proteger algunos datos de miembros

source: Add the ``RCPPUTILS_TSA_GUARDED_BY(mutex_name)`` annotation to the data that is protected by the mutex
es: Agrega la anotación ``RCPPUTILS_TSA_GUARDED_BY(mutex_name)`` a los datos que están protegidos por el mutex

source: Step 2 - Fix Warnings
es: Paso 2: corregir advertencias

source: In the above example - ``Foo::get`` will produce a compiler warning! To fix it, lock before returning bar
es: En el ejemplo anterior, ``Foo::get`` producirá una advertencia del compilador. Para solucionarlo, bloquear antes de volver a la bar

source: Step 3 - (Optional but Recommended) Refactor Existing Code to Private-Mutex Pattern
es: Paso 3 - (Opcional pero recomendado) Refactorizar el código existente a un patrón privado-Mutex

source: A recommended pattern in threaded C++ code is to always keep your ``mutex`` as a ``private:`` member of the data structure. This makes data safety the concern of the containing structure, offloading that responsibility from users of the structure and minimizing the surface area of affected code.
es: Un patrón recomendado en código C++ multihilo es mantener siempre su ``mutex`` como miembro ``privado:`` de la estructura de datos. Esto hace que la seguridad de los datos sea la preocupación de la estructura contenedora, descargando esa responsabilidad de los usuarios de la estructura y minimizando el área superficial del código afectado.

source: Making your locks private may require rethinking the interfaces to your data. This is a great exercise - here are a few things to consider
es: Hacer que sus bloqueos sean privados puede requerir repensar las interfaces de sus datos. Este es un gran ejercicio - aquí hay algunas cosas a considerar

source: You may want to provide specialized interfaces for performing analysis that requires complex locking logic, e.g. counting members in a filtered set of a mutex-guarded map structure, instead of actually returning the underlying structure to consumers
es: Es posible que desees proporcionar interfaces especializadas para realizar análisis que requieran una lógica de bloqueo compleja, p. contar miembros en un conjunto filtrado de una estructura de mapa protegida por mutex, en lugar de devolver la estructura subyacente a los consumidores

source: Consider copying to avoid blocking, where the amount of data is small. This can let other threads get on with accessing the shared data, which can potentially lead to better overall performance.
es: Considera la posibilidad de copiar para evitar el bloqueo, donde la cantidad de datos es pequeña. Esto puede permitir que otros hilos sigan accediendo a los datos compartidos, lo que potencialmente puede conducir a un mejor rendimiento general.

source: Step 4 - (Optional) Enable Negative Capability Analysis
es: Paso 4 - (Opcional) Habilitar análisis de capacidad negativa

source: Negative Capability Analysis lets you specify “this lock must not be held when calling this function”. It can reveal potential deadlock cases that other annotations cannot.
es: El análisis de capacidad negativa te permite especificar "este bloqueo no debe mantenerse al llamar a esta función". Puede revelar posibles casos de punto muerto que otras anotaciones no pueden.

source: Where you specified ``-Wthread-safety``, add the additional flag ``-Wthread-safety-negative``
es: Donde especificas ``-Wthread-safety``, agrega el indicador adicional ``-Wthread-safety-negative``

source: On any function that acquires a lock, use the ``RCPPUTILS_TSA_REQUIRES(!mutex)`` pattern
es: En cualquier función que adquiera un bloqueo, a el patrón ``RCPPUTILS_TSA_REQUIRES(!mutex)``

source: How to run the analysis
es: Cómo ejecutar el análisis

source: The ROS CI build farm runs a nightly job with ``libcxx``, which will surface any issues in the ROS 2 core stack by being marked "Unstable" when Thread Safety Analysis raises warnings
es: La granja de compilación ROS CI ejecuta un trabajo nocturno con ``libcxx``, que hará surgir cualquier problema en la pila principal de ROS 2 al marcarse como "Inestable" cuando Thread Safety Analysis genere advertencias

source: For local runs, you have the following options, all equivalent
es: Para ejecuciones locales, tienes las siguientes opciones, todas equivalentes

source: Use the colcon `clang-libcxx mixin <https://github.com/colcon/colcon-mixin-repository/blob/master/clang-libcxx.mixin>`__ (see the `documentation <https://github.com/colcon/colcon-mixin-repository/blob/master/README.md>`__ for configuring mixins) ::
es: Utiliza el mixin colcon `clang-libcxx <https://github.com/colcon/colcon-mixin-repository/blob/master/clang-libcxx.mixin>`__

source: Passing compiler to CMake ::
es: ``construcción colcon --mixin clang-libcxx``

source: Overriding system compiler ::
es: Solo puedes usar esto si tiene `mixins configurados para su instalación de colcon <https://github.com/colcon/colcon-mixin-repository/blob/master/README.md>`__

source: **Resulting Context:**
es: Pasar el compilador a CMake

source: Potential deadlocks and race conditions will be surfaced at compile time, when using Clang and ``libcxx``
es: ``colcon build --cmake-args -DCMAKE_C_COMPILER=clang -DCMAKE_CXX_COMPILER=clang++ -DCMAKE_CXX_FLAGS='-stdlib=libc++ -D_LIBCPP_ENABLE_THREAD_SAFETY_ANNOTATIONS' -DFORCE_BUILD_VENDOR_PKG=ON --no-warn-unused-cli``

source: Dynamic analysis (data races & deadlocks)
es: Anulación del compilador del sistema

source: You are developing/debugging your multithreaded C++ production code.
es: ``CC=clang CXX=clang++ colcon build --cmake-args -DCMAKE_CXX_FLAGS='-stdlib=libc++ -D_LIBCPP_ENABLE_THREAD_SAFETY_ANNOTATIONS' -DFORCE_BUILD_VENDOR_PKG=ON --no-warn-unused-cli``

source: You use pthreads or C++11 threading + llvm libc++ (in case of ThreadSanitizer).
es: **Contexto resultante:**

source: You do not use Libc/libstdc++ static linking (in case of ThreadSanitizer).
es: Los interbloqueos potenciales y las condiciones de ejecución aparecerán en el momento de la compilación, al usar Clang y ``libcxx``

source: You do not build non-position-independent executables (in case of ThreadSanitizer).
es: Análisis dinámico (ejecución de datos y puntos muertos)

source: Data races and deadlocks cannot be detected using static analysis (reason: limitation of static analysis).
es: Estas desarrollando/depurando tu código de producción C++ multiproceso.

source: Data races and deadlocks must not show up during development debugging / testing (reason: usually not all possible control paths through production code exercised).
es: Usas pthreads o C++11 threading + llvm libc++ (en el caso de ThreadSanitizer).

source: Use a dynamic analysis tool which focuses on finding data races and deadlocks (here clang ThreadSanitizer).
es: No utilizas enlaces estáticos Libc/libstdc++ (en el caso de ThreadSanitizer).

source: Compile and link the production code with clang using the option ``-fsanitize=thread`` (this instruments the production code).
es: No creas ejecutables que no sean independientes de la posición (en el caso de ThreadSanitizer).

source: In case different production code shall be executed during analysis consider conditional compilation e.g. `ThreadSanitizers _has_feature(thread_sanitizer) <https://clang.llvm.org/docs/ThreadSanitizer.html#has-feature-thread-sanitizer>`__.
es: Las condiciones de carrera y los interbloqueos pueden provocar errores críticos.

source: In case some code shall not be instrumented consider `ThreadSanitizers _/*attribute*/_((no_sanitize("thread"))) <https://clang.llvm.org/docs/ThreadSanitizer.html#attribute-no-sanitize-thread>`__.
es: Las condiciones de carrerq y los interbloqueos no se pueden detectar mediante el análisis estático (motivo: limitación del análisis estático).

source: In case some files shall not be instrumented consider file or function-level exclusion `ThreadSanitizers blacklisting <https://clang.llvm.org/docs/ThreadSanitizer.html#ignorelist>`__, more specific: `ThreadSanitizers Sanitizer Special Case List <https://clang.llvm.org/docs/SanitizerSpecialCaseList.html>`__ or with `ThreadSanitizers no_sanitize("thread") <https://clang.llvm.org/docs/ThreadSanitizer.html#ignorelist>`__ and use the option ``--fsanitize-blacklist``.
es: Las condiciones de carrera y los interbloqueos no deben aparecer durante la depuración/prueba del desarrollo (razón: por lo general, no se ejercen todas las rutas de control posibles a través del código de producción).

source: **Resulting context:**
es: Utilizar una herramienta de análisis dinámico que se centre en la búsqueda de condiciones de carrera y puntos muertos (aquí clang ThreadSanitizer).

source: Higher chance to find data races and deadlocks in production code before deploying it.
es: Compila y vincula el código de producción con clang usando la opción ``-fsanitize=thread`` (esto instrumenta el código de producción).

source: Analysis result may lack reliability, tool in beta phase stage (in case of ThreadSanitizer).
es: En caso de que se ejecute un código de producción diferente durante el análisis, considere la compilación condicional, p. `ThreadSanitizers _has_feature(thread_sanitizer) <https://clang.llvm.org/docs/ThreadSanitizer.html#has-feature-thread-sanitizer>`__.

source: Overhead due to production code instrumentation (maintenance of separate branches for instrumented/not instrumented production code, etc.).
es: En caso de que no se instrumente algún código, considere `ThreadSanitizers _/*attribute*/_((no_sanitize("thread"))) <https://clang.llvm.org/docs/ThreadSanitizer.html#attribute-no- higienizar-hilo>`__.

source: Instrumented code needs more memory per thread (in case of ThreadSanitizer).
es: En caso de que algunos archivos no se instrumenten, considera la exclusión a nivel de archivo o función `ThreadSanitizers blacklisting <https://clang.llvm.org/docs/ThreadSanitizer.html#ignorelist>`__, más específicamente: `ThreadSanitizers Sanitizer Special Case List <https://clang.llvm.org/docs/SanitizerSpecialCaseList.html>`__ o con `ThreadSanitizers no_sanitize("thread") <https://clang.llvm.org/docs/ThreadSanitizer.html#ignorelist>`__ y usa la opción ``--fsanitize-blacklist``.

source: Instrumented code maps a lot virtual address space (in case of ThreadSanitizer).
es: Mayor probabilidad de encontrar carreras de datos y puntos muertos en el código de producción antes de implementarlo.
