Repository: audrow/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Tutorials/Demos/Content-Filtering-Subscription.po
Languages: es

source: Creating a content filtering subscription
es: Creación de un suscriptor de filtrado de contenido

source: **Goal:** Create a content filtering subscription.
es: **Objetivo:** Crear un suscriptor de filtrado de contenido.

source: **Tutorial level:** Advanced
es: **Nivel del Tutorial:** Avanzado

source: **Time:** 15 minutes
es: **Tiempo:** 15 minutos

source: Table of Contents
es: Tabla de contenidos

source: Overview
es: Descripción

source: ROS 2 applications typically consist of topics to transmit data from publishers to subscriptions. Basically, subscriptions receive all published data from publishers on the topic. But sometimes, a subscription might be interested in only a subset of the data which is being sent by publishers. A content filtering subscription allows to receive only the data of interest for the application.
es: Las aplicaciones de ROS 2 generalmente consisten en topics para transmitir datos de los publicadores a las suscriptores. Básicamente, los suscriptores reciben todos los datos publicados de los publicadores por el topic. A veces, una suscripción puede estar interesada solo en un subconjunto de los datos que envían los publicadores. Un suscriptor de filtrado de contenido permite recibir solo los datos de interés para la aplicación.

source: In this demo, we'll be highlighting how to create a content filtering subscription and how they work.
es: En esta demo, destacaremos cómo crear un suscriptor que filtra contenido y cómo funcionan.

source: RMW Support
es: Soporte RMW

source: Content filtering subscriptions require RMW implementation support.
es: Los suscriptores de filtrado de contenido requieren compatibilidad con la implementación de RMW.

source: Content-Filtering-Subscription Support Status
es: Estado de soporte de suscriptor de filtrado de contenido

source: supported
es: soportado

source: not supported
es: no soportado

source: Currently all RMW implementations that support content filtering subscriptions are `DDS <https://www.omg.org/omg-dds-portal/>`__ based. That means that the supported filtering expressions and parameters are also dependent on `DDS <https://www.omg.org/omg-dds-portal/>`__, you can refer to `DDS specification <https://www.omg.org/spec/DDS/1.4/PDF>`__ ``Annex B - Syntax for Queries and Filters`` for details.
es: Actualmente, todas las implementaciones de RMW que admiten suscripciones de filtrado de contenido están basadas en `DDS <https://www.omg.org/omg-dds-portal/>`__. Eso significa que las expresiones y parámetros de filtrado compatibles también dependen de `DDS <https://www.omg.org/omg-dds-portal/>`__, puedes consultar la especificación `DDS <https://www. omg.org/spec/DDS/1.4/PDF>`__ ``Annex B - Syntax for Queries and Filters`` para obtener detalles.

source: Installing the demo
es: Instalación de la demo

source: See the :doc:`installation instructions <../../Installation>` for details on installing ROS 2.
es: Consulta las :doc:`installation instructions <../../Installation>` para obtener detalles sobre la instalación de ROS 2.

source: If you've installed ROS 2 from packages, ensure that you have ``ros-rolling-demo-nodes-cpp`` installed. If you downloaded the archive or built ROS 2 from source, it will already be part of the installation.
es: Si ha instalado ROS 2 desde paquetes, asegúrate de tener ``ros-rolling-demo-nodes-cpp`` instalado. Si descargaste el archivo o creó ROS 2 desde fuentes, ya será parte de la instalación.

source: Temperature filtering demo
es: Demostración de filtrado de temperatura

source: This demo shows how a content filtering subscription can be used to only receive temperature values that are out of the acceptable temperature range, detecting emergencies. The content filtering subscription filters out the uninteresting temperature data, so that the subscription callback is not issued.
es: Esta demostración muestra cómo se puede usar un suscriptor de filtrado de contenido para recibir solo valores de temperatura que están fuera del rango de temperatura aceptable, detectando emergencias. El suscriptor de filtrado de contenido filtra los datos de temperatura poco interesantes, de modo que no se emite el callback del suscriptor

source: The content filter is defined in the subscription side, publishers don't need to be configured in any special way to allow content filtering. The ``ContentFilteringPublisher`` node publishes simulated temperature data starting from -100.0 and ending at 150.0 with a step size of 10.0 every second.
es: El filtro de contenido se define en el lado de la suscripción, los publicadores no necesitan configurarse de ninguna manera especial para permitir el filtrado de contenido. El nodo ``ContentFilteringPublisher`` publica datos de temperatura simulados desde -100,0 hasta 150,0 con un tamaño de paso de 10,0 cada segundo.

source: We can run the demo by running the ``ros2 run demo_nodes_cpp content_filtering_publisher`` executable (don't forget to source the setup file first):
es: Podemos ejecutar la demo ejecutando ``ros2 run demo_nodes_cpp content_filtering_publisher`` (no olvide hacer source del install.bash del paquete):

source: To enable content filtering, applications can set the filtering expression and the expression parameters in ``SubscriptionOptions``. The application can also check if content filtering is enabled on the subscription.
es: Para habilitar el filtrado de contenido, las aplicaciones pueden configurar la expresión de filtrado y los parámetros de expresión en ``SubscriptionOptions``. La aplicación también puede verificar si el filtrado de contenido está habilitado en la suscripción.

source: In this demo, the ``ContentFilteringSubscriber`` node creates a content filtering subscription that receives a message only if the temperature value is less than -30.0 or greater than 100.0.
es: En esta demo, el nodo ``ContentFilteringSubscriber`` crea una suscripción de filtrado de contenido que recibe un mensaje solo si el valor de la temperatura es inferior a -30,0 o superior a 100,0.

source: As commented before, content filtering subscription support depends on the RMW implementation. Applications can use the ``is_cft_enabled`` method to check if content filtering is actually enabled on the subscription.
es: Como se comentó anteriormente, el soporte de suscripción de filtrado de contenido depende de la implementación de RMW. Las aplicaciones pueden usar el método ``is_cft_enabled`` para verificar si el filtrado de contenido está realmente habilitado en la suscripción.

source: To test content filtering subscription, let's run it:
es: Para probar la suscripción de filtrado de contenido, ejecutémoslo:

source: You should see a message showing the content filtering options used and logs for each message received only if the temperature value is less than -30.0 or greater than 100.0.
es: Deberías ver un mensaje que muestre las opciones de filtrado de contenido utilizadas y los registros de cada mensaje recibido solo si el valor de la temperatura es inferior a -30,0 o superior a 100,0.

source: If content filtering is not supported by the RMW implementation, the subscription will still be created without content filtering enabled. We can try that by executing ``RMW_IMPLEMENTATION=rmw_cyclonedds_cpp ros2 run demo_nodes_cpp content_filtering_publisher``.
es: Si la implementación de RMW no admite el filtrado de contenido, la suscripción aún se creará sin el filtrado de contenido habilitado. Podemos intentarlo ejecutando ``RMW_IMPLEMENTATION=rmw_cyclonedds_cpp ros2 run demo_nodes_cpp content_filtering_publisher``.

source: You can see the message ``Content filter is not enabled`` because underlying RMW implementation does not support the feature, but the demo still successfully creates the normal subscription to receive all temperature data.
es: Puedes ver el mensaje ``Content filter is not enabled`` porque la implementación de RMW subyacente no es compatible con la función, pero la demostración aún crea correctamente la suscripción normal para recibir todos los datos de temperatura.

source: Related content
es: Contenido relacionado

source: `content filtering examples <https://github.com/ros2/examples/blob/rolling/rclcpp/topics/minimal_subscriber/content_filtering.cpp>`__ that covers all interfaces for content filtering subscription.
es: `ejemplos de filtrado de contenido <https://github.com/ros2/examples/blob/rolling/rclcpp/topics/minimal_subscriber/content_filtering.cpp>`__ que cubren todas las interfaces para la suscripción de filtrado de contenido.

source: `content filtering design PR <https://github.com/ros2/design/pull/282>`__
es: `diseño de filtrado de contenido PR <https://github.com/ros2/design/pull/282>`__
