Repository: audrow/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Tutorials/Demos/dummy-robot-demo.po
Languages: es

source: Experimenting with a dummy robot
es: Experimentando con un robot ficticio

source: In this demo, we present a simple demo robot with all components from publishing joint states over publishing fake laser data until visualizing the robot model on a map in RViz.
es: En esta demo, presentamos un robot de demostración simple con todos los componentes, desde la publicación de estados conjuntos hasta la publicación de datos láser falsos hasta la visualización del modelo de robot en un mapa en RViz.

source: Launching the demo
es: Lanzamiento de la demo

source: We assume your ROS 2 installation dir as ``~/ros2_ws``. Please change the directories according to your platform.
es: Asumimos que tu directorio de instalación de ROS 2 es ``~/ros2_ws``. Cambia los directorios según su plataforma.

source: To start the demo, we execute the demo bringup launch file, which we are going to explain in more details in the next section.
es: Para iniciar la demo, ejecutamos el archivo de inicio de la demo, que explicaremos con más detalle en la siguiente sección.

source: You should see some prints inside your terminal along the lines of the following:
es: Deberías ver algunas impresiones dentro de su terminal a lo largo de las siguientes líneas:

source: If you now open in a next terminal your RViz, you'll see your robot. 🎉
es: Si ahora abres en una terminal tu RViz, verás tu robot. 🎉

source: This opens RViz2. Assuming you have your dummy_robot_bringup still launched, you can now add the TF display plugin and configure your global frame to ``world``. Once you did that, you should see a similar picture:
es: Esto abre RViz2. Suponiendo que todavía tienes su dummy_robot_bringup lanzado, ahora puedes agregar el complemento de pantalla TF y configurar su marco global para ``world``. Una vez que hayas hecho eso, deberías ver una imagen similar:

source: What's happening?
es: ¿Qué esta pasando?

source: If you have a closer look at the launch file, we start a couple of nodes at the same time.
es: Si observas más de cerca el archivo de inicio, iniciamos un par de nodos al mismo tiempo.

source: The first two packages are relatively simple. The ``dummy_map_server`` constantly publishes an empty map with a periodic update. The ``dummy_laser`` does basically the same; publishing dummy fake laser scans.
es: Los primeros dos paquetes son relativamente simples. El ``dummy_map_server`` publica constantemente un mapa vacío con una actualización periódica. El ``dummy_laser`` hace básicamente lo mismo; publicación de escaneos láser falsos ficticios.

source: The ``dummy_joint_states`` node is publishing fake joint state data. As we are publishing a simple RRbot with only two joints, this node publishes joint states values for these two joints.
es: El nodo ``dummy_joint_states`` está publicando datos de joint states falsos. Como estamos publicando un RRbot simple con solo dos articulaciones, este nodo publica valores de joint states para estas dos articulaciones.

source: The ``robot_state_publisher`` is doing the actual interesting work. It parses the given URDF file, extracts the robot model and listens to the incoming joint states. With this information, it publishes TF values for our robot which we visualize in RViz.
es: El ``robot_state_publisher`` está haciendo un trabajo realmente interesante. Analiza el archivo URDF dado, extrae el modelo de robot y escucha los estados de unión entrantes. Con esta información publica valores de TF para nuestro robot que visualizamos en RViz.

source: Hooray!
es: ¡Hurra!
