Repository: audrow/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Tutorials/Intermediate/Launch/Launch-Main.po
Languages: es

source: ROS 2 Launch files allow you to start up and configure a number of executables containing ROS 2 nodes simultaneously.
es: Los ficheros de ROS 2 launch te permiten iniciar y configurar varios ejecutables que contienen nodos de ROS 2 simultáneamente.

source: :doc:`Creating a launch file <./Creating-Launch-Files>`.
es: :doc:`Crear un fichero de launch<./Creating-Launch-Files>`.

source: Learn how to create a launch file that will start up nodes and their configurations all at once.
es: Aprende como crear un fichero de launch que iniciará nodos y sus configuraciones de una sola vez.

source: :doc:`Launching and monitoring multiple nodes <./Launch-system>`.
es: :doc:`Launching y monitorizado de multiples nodos <./Launch-system>`.

source: Get a more advanced overview of how launch files work.
es: Obtén una visión general mas avanzada de como funcionan los ficheros de launch.

source: :doc:`Using substitutions <./Using-Substitutions>`.
es: :doc:`Utilizar substituciones <./Using-Substitutions>`.

source: Use substitutions to provide more flexibility when describing reusable launch files.
es: Usa substituciones para proveer mayor flexibilidad cuando describas ficheros launch reusables.

source: :doc:`Using event handlers <./Using-Event-Handlers>`.
es: :doc:`Utilizar controladores de evento <./Using-Event-Handlers>`.

source: Use event handlers to monitor the state of processes or to define a complex set of rules that can be used to dynamically modify the launch file.
es: Usa controladores de evento para monitorizar el estado de los procesos o para definir un conjunto complejo de reglas que pueden ser utilizados para modificar de forma dinámica los ficheros de launch.

source: :doc:`Managing large projects <./Using-ROS2-Launch-For-Large-Projects>`.
es: :doc:`Gestión de proyectos grandes <./Using-ROS2-Launch-For-Large-Projects>`.

source: Structure launch files for large projects so they may be reused as much as possible in different situations. See usage examples of different launch tools like parameters, YAML files, remappings, namespaces, default arguments, and RViz configs.
es: Estructura ficheros de launch para proyectos grandes para poder reutilizarlos tanto como sea posible en diferentes situaciones. Ve ejemplos de uso de diferentes herramientas de launch como parámetros, ficheros YAML, remappings, namespaces, argumentos por defecto, y configuraciones de RViz.

source: If you are coming from ROS 1, you can use the :doc:`ROS Launch Migration guide <../../../How-To-Guides/Launch-files-migration-guide>` to help you migrate your launch files to ROS 2.
es: Si tu vienes de ROS 1, puedes ver el :doc:`ROS Launch guía de migración <../../../How-To-Guides/Launch-files-migration-guide>` para ayudarte a migrar tus ficheros launch a ROS 2.
