Repository: audrow/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Tutorials/Intermediate/Launch/Launch-system.po
Languages: es

source: Integrating launch files into ROS 2 packages
es: Integrar ficheros de launch a paquetes de ROS 2

source: **Goal:** Add a launch file to a ROS 2 package
es: **Objetivo:** Añadir un fichero de launch a un paquete de ROS 2

source: **Tutorial level:** Intermediate
es: **Nivel del tutorial:** Intermedio

source: **Time:** 10 minutes
es: **Tiempo:** 10 minutos

source: Contents
es: Contenidos

source: Prerequisites
es: Prerequisitos

source: You should have gone through the tutorial on how to :doc:`create a ROS 2 package <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`.
es: Deberías de haber repasado el tutorial sobre como :doc:`Crear un paquete de ROS 2<../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`.

source: As always, don’t forget to source ROS 2 in :doc:`every new terminal you open <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.
es: Como siempre, no te olvides de sincronizar las fuentes de ROS 2 en :doc:`cada terminal que abra <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.

source: Background
es: Antecedentes

source: In the :doc:`previous tutorial <Creating-Launch-Files>`, we saw how to write a standalone launch file. This tutorial will show how to add a launch file to an existing package, and the conventions typically used.
es: En el :doc:`tutorial anterior <Creating-Launch-Files>`, vimos como escribir un fichero de launch independiente. Este tutorial mostrará como añadir un fichero de launch a un paquete existente, y las convenciones que se suelen utilizar.

source: Tasks
es: Tareas

source: 1 Create a package
es: 1 Crear un paquete

source: Create a workspace for the package to live in:
es: Crea un workspace donde vivirá el paquete:

source: 2 Creating the structure to hold launch files
es: 2 Crear la estructura para mantener ficheros de launch

source: By convention, all launch files for a package are stored in the ``launch`` directory inside of the package. Make sure to create a ``launch`` directory at the top-level of the package you created above.
es: Por convención, todos los ficheros de launch para un paquete son almacenados en la carpeta ``launch`` dentro del paquete. Asegúrate de crear la carpeta ``launch`` en el nivel mas alto del paquete que creaste arriba.

source: For Python packages, the directory containing your package should look like this:
es: Para los paquetes de Python, la carpeta que contiene tu paquete debe verse como esto:

source: In order for colcon to find the launch files, we need to inform Python's setup tools of our launch files using the ``data_files`` parameter of ``setup``.
es: Para que colcon pueda encontrar los ficheros de launch, necesitamos informar a las herramientas de setup de Pyton acerca de nuestros ficheros de launch usando el parámetro ``data_files`` de ``setup``.

source: Inside our ``setup.py`` file:
es: Dentro de nuestro fichero ``setup.py``:

source: For C++ packages, we will only be adjusting the ``CMakeLists.txt`` file by adding:
es: Para los paquetes de C++, solo ajustaremos el fichero de ``CMakeLists.txt`` añadiendo:

source: to the end of the file (but before ``ament_package()``).
es: al final del fichero (pero antes de ``ament_package()``).

source: 3 Writing the launch file
es: 3 Escribir el fichero de launch

source: Inside your ``launch`` directory, create a new launch file called ``my_script_launch.py``. ``_launch.py`` is recommended, but not required, as the file suffix for Python launch files. However, the launch file name needs to end with ``launch.py`` to be recognized and autocompleted by ``ros2 launch``.
es: Dentro de tu carpeta ``launch``, crea un nuevo fichero de launch llamado ``my_script_launch.py``. Se recomienda``_launch.py``, aunque no es obligatorio, como sufijo para ficheros de launch de Python. Sin embargo, el nombre del fichero de launch necesita terminar con ``launch.py`` para ser reconocido y autocompletado por ``ros2 launch``.

source: Your launch file should define the ``generate_launch_description()`` function which returns a ``launch.LaunchDescription()`` to be used by the ``ros2 launch`` verb.
es: Tu fichero de launch debe definir la función ``generate_launch_description()``, la cual regresa un ``launch.LaunchDescription()`` que es usado por el verbo ``ros2 launch``.

source: Inside your ``launch`` directory, create a new launch file called ``my_script_launch.xml``. ``_launch.xml`` is recommended, but not required, as the file suffix for XML launch files.
es: Dentro de tu carpeta ``launch``, crea un nuevo fichero de launch llamado ``my_script_launch.xml``. Se recomienda``_launch.xml``, aunque no es obligatorio, como sufijo para ficheros de launch de XML.

source: Inside your ``launch`` directory, create a new launch file called ``my_script_launch.yaml``. ``_launch.yaml`` is recommended, but not required, as the file suffix for YAML launch files.
es: Dentro de tu carpeta ``launch``, crea un nuevo fichero de launch llamado ``my_script_launch.yaml``. Se recomienda``_launch.xml``, aunque no es obligatorio, como sufijo para ficheros de launch de YAML.

source: 4 Building and running the launch file
es: 4 Compilar y ejecutar el fichero de launch

source: Go to the top-level of the workspace, and build it:
es: Ve al nivel mas alto del workspace, y compílalo:

source: After the ``colcon build`` has been successful and you've sourced the workspace, you should be able to run the launch file as follows:
es: Después de que ``colcon build`` haya sido exitoso y que hayas ejecutado source en el workspace, deberías de ser capas de ejecutar el fichero de launch como sigue:

source: Documentation
es: Documentación

source: `The launch documentation <https://github.com/ros2/launch/blob/rolling/launch/doc/source/architecture.rst>`__ provides more details on concepts that are also used in ``launch_ros``.
es: `The launch documentation <https://github.com/ros2/launch/blob/rolling/launch/doc/source/architecture.rst>`__ provides more details on concepts that are also used in ``launch_ros``. `La documentación de launch <https://github.com/ros2/launch/blob/rolling/launch/doc/source/architecture.rst>`__ provee mas destalles sobre los conceptos que también son usados en ``launch_ros``.

source: Additional documentation/examples of launch capabilities are forthcoming. See the source code (https://github.com/ros2/launch and https://github.com/ros2/launch_ros) in the meantime.
es: Documentación y ejemplos adicionales sobre las capacidades de launch están por venir. De momento ve el código fuente (https://github.com/ros2/launch y https://github.com/ros2/launch_ros).
