Repository: audrow/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Related-Projects/Nvidia-ROS2-Projects.po
Languages: es

source: NVIDIA ROS 2 Projects
es: Proyectos de ROS 2 por NVIDIA

source: NVIDIA Jetson is working towards developing ROS 2 packages to ease the development of AI applications for robotics.
es: NVIDIA Jetson trabaja en el desarrollo de paquetes de ROS2 con el find e facilitar el desarrollo de inteligencia artificial para la robótica.

source: `Isaac ROS Nvblox <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_nvblox>`__ : Hardware-accelerated 3D scene reconstruction and Nav2 local costmap provider using nvblox.
es: `Isaac ROS Nvblox <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_nvblox>`__ : Reconstruccion 3D de escenas y costmap locales para Nav2 usando nvblox.

source: `Isaac ROS Object Detection <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_object_detection>`__ : Deep learning model support for object detection including DetectNet.
es: `Isaac ROS Detección de objetos <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_object_detection>`__ : Modelos de detección de objeto incluyendo DetectNet.

source: `Isaac ROS DNN Inference <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_dnn_inference>`__ : This repository provides two NVIDIA GPU-accelerated ROS 2 nodes that perform deep learning inference using custom models. One node uses the TensorRT SDK, while the other uses the Triton SDK.
es: `Isaac ROS Inferencia DNN <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_dnn_inference>`__ : Este repositorio contiene nodos de ROS 2 que realizan inferencias usando diferentes modelos de inteligencia artificial. Uno de los nodos usa TensorRT SDK, mientras que el otro usa Triton SDK.

source: `Isaac ROS Visual SLAM <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_visual_slam>`__ : This repository provides a ROS 2 package that estimates stereo visual inertial odometry using the Isaac Elbrus GPU-accelerated library.
es: `Isaac ROS SLAM Visual <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_visual_slam>`__ : Este repositorio contiene un paquete de ROS 2 que estima la odometría visual inercial usando la librería Isaac Elbrus GPU.

source: `Isaac ROS Argus Camera <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_argus_camera>`__ : This repository provides monocular and stereo nodes that enable ROS developers to use cameras connected to Jetson platforms over a CSI interface.
es: `Isaac ROS Cámara Argus <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_argus_camera>`__ : Este repositorio permite usar cámaras conectadas a plataformas Jetson mediante una interfaz CSI.

source: `Isaac ROS image_pipeline <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_image_pipeline>`__ : This metapackage offers similar functionality as the standard, CPU-based image_pipeline metapackage, but does so by leveraging the Jetson platform's specialized computer vision hardware.
es: `Isaac ROS image_pipeline <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_image_pipeline>`__ : Este paquete ofrece funcionalidades estándar de vision por computadora enfocado a plataformas Jetson.

source: `Isaac ROS Common <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_common>`__ : Isaac ROS common utilities for use in conjunction with the Isaac ROS suite of packages.
es: `Isaac ROS Common <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_common>`__ : Utilidades comunes para usar junto con Isaac ROS.

source: `Isaac ROS AprilTags <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_apriltag>`__ : ROS 2 node uses the NVIDIA GPU-accelerated AprilTags library to detect AprilTags in images and publish their poses, ids, and additional metadata.
es: `Isaac ROS AprilTags <https://github.com/NVIDIA-ISAAC-ROS/isaac_ros_apriltag>`__ : Nodo de ROS2 que usa la librería AprilTags en imágenes, publicando sus posiciones, ids e información adicional.

source: `ROS and ROS 2 Docker Images <https://github.com/NVIDIA-AI-IOT/ros2_jetson/tree/main/docker>`__ : Docker images for easy deployment on the NVIDIA Jetson platform, consisting of ROS 2, PyTorch, and other important machine learning libraries.
es: `ROS y ROS 2 Docker Images <https://github.com/NVIDIA-AI-IOT/ros2_jetson/tree/main/docker>`__ : Imágenes Docker para ROS2

source: `ROS and ROS 2 DockerFiles <https://github.com/dusty-nv/jetson-containers>`__: Dockerfiles for ROS 2 based on l4t which all you to build your own Docker image.
es: `ROS y ROS 2 DockerFiles <https://github.com/dusty-nv/jetson-containers>`__: Dockerfiles para ROS 2 based.

source: `ROS 2 Packages for PyTorch and TensorRT <https://github.com/NVIDIA-AI-IOT/ros2_torch_trt>`__: ROS 2 packageis for classification and object detection tasks using PyTorch and NVIDIA TensorRT. This tutorial is a good starting point AI integration with ROS 2 on NVIDIA Jetson.
es: `Paquetes ROS 2 para PyTorch y TensorRT <https://github.com/NVIDIA-AI-IOT/ros2_torch_trt>`__: Paquetes ROS 2 para clasificación y detección de objetos usando PyTorch y NVIDIA TensorRT.

source: `ROS / ROS 2 Packages for Accelerated Deep Learning Nodes <https://github.com/dusty-nv/ros_deep_learning>`__: Deep learning image recognition, object detection, and semantic segmentation inference nodes and camera/video streaming nodes for ROS/ROS 2 using the `jetson-inference <https://github.com/dusty-nv/jetson-inference>`__ library and `NVIDIA Hello AI World tutorial <https://developer.nvidia.com/embedded/twodaystoademo>`__.
es: `Paquetes ROS / ROS 2 para Nodos con Deep Learning <https://github.com/dusty-nv/ros_deep_learning>`__: Reconocimiento de imágenes, detección de objetos y segmentación semántica usando `jetson-inference <https://github.com/dusty-nv/jetson-inference>`__ y `NVIDIA Hello AI World tutorial <https://developer.nvidia.com/embedded/twodaystoademo>`__.

source: `ROS 2 Package for Human Pose Estimation <https://github.com/NVIDIA-AI-IOT/ros2_trt_pose>`__: A ROS 2 package for human pose estimation.
es: `Paquete de ROS 2 Package para estimar poses humanas <https://github.com/NVIDIA-AI-IOT/ros2_trt_pose>`__: Paquete para estimar poses humanas

source: `ROS 2 Package for Hand Pose Estimation and Gesture Classification <https://github.com/NVIDIA-AI-IOT/ros2_trt_pose_hand>`__: A ROS 2 package for real-time hand pose estimation and gesture classification using TensorRT.
es: `Paquetes de ROS 2 para estimar poses de manos humanas y clasificacion de gestos <https://github.com/NVIDIA-AI-IOT/ros2_trt_pose_hand>`__: Paquete para estimar poses de manos humanas en tiempo real asi como clasificación de gestos usando TensorRT.

source: `GPU accelerated ROS 2 Packages for Monocular Depth Estimation <https://github.com/NVIDIA-AI-IOT/ros2_torch2trt_examples>`__: ROS 2 package for NVIDIA GPU-accelerated torch2trtxb examples such as monocular depth estimation and text detection.
es: `Paquetes de ROS2 para estimación de profundidad monocular <https://github.com/NVIDIA-AI-IOT/ros2_torch2trt_examples>`__: Paquete de ROS2 para usar la librería.

source: `ROS 2 Package for Jetson stats <https://github.com/NVIDIA-AI-IOT/ros2_jetson_stats>`__: ROS 2 package for monitoring and controlling your NVIDIA Jetson [Xavier NX, Nano, AGX Xavier, TX1, TX2].
es: `Paquetes de ROS 2 para estadísticas de Jetson <https://github.com/NVIDIA-AI-IOT/ros2_jetson_stats>`__: Paquete para monitorear y controlar tu NVIDIA Jetson [Xavier NX, Nano, AGX Xavier, TX1, TX2].

source: `ROS 2 Packages for DeepStream SDK <https://github.com/NVIDIA-AI-IOT/ros2_deepstream>`__: ROS 2 package for NVIDIA DeepStream SDK.
es: `Paquetes de ROS 2 para DeepStream SDK <https://github.com/NVIDIA-AI-IOT/ros2_deepstream>`__: Paquete para NVIDIA DeepStream SDK.

source: Simulation Projects
es: Proyectos de simulación

source: `Isaac Sim Nav2 <https://docs.omniverse.nvidia.com/app_isaacsim/app_isaacsim/tutorial_ros2_navigation.html>`__ : In this ROS 2 sample, we are demonstrating Omniverse Isaac Sim integrated with the ROS 2 Nav2 project.
es: `Isaac Sim Nav2 <https://docs.omniverse.nvidia.com/app_isaacsim/app_isaacsim/tutorial_ros2_navigation.html>`__ : Demostraciones del simulador Isaac Sim junto con ROS 2 Nav2.

source: `Isaac Sim Multiple Robot ROS 2 Navigation <https://docs.omniverse.nvidia.com/app_isaacsim/app_isaacsim/tutorial_ros2_multi_navigation.html>`__ : In this ROS 2 sample, we are demonstrating Omniverse Isaac Sim integrated with the ROS 2 Nav2 stack to perform simultaneous multiple robot navigation.
es: `Isaac Sim Multiple Robot ROS 2 Navigation <https://docs.omniverse.nvidia.com/app_isaacsim/app_isaacsim/tutorial_ros2_multi_navigation.html>`__ : Demostraciones del simulador Isaac Sim, para la navegación de multiples robots usando Nav2.

source: References
es: Referencias

source: More updates on NVIDIA Jetson ROS 2 can be found `here <https://nvidia-ai-iot.github.io/ros2_jetson/>`__.
es: Actualizaciones de Jetson ROS 2 se pueden encontrar `aca <https://nvidia-ai-iot.github.io/ros2_jetson/>`__.
