Repository: audrow/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Installation/DDS-Implementations/Working-with-Eclipse-CycloneDDS.po
Languages: es

source: Eclipse Cyclone DDS is a very performant and robust open-source DDS implementation. Cyclone DDS is developed completely in the open as an Eclipse IoT project. See also: https://projects.eclipse.org/projects/iot.cyclonedds
es: Eclipse Cyclone DDS es una implementación de DDS de código abierto robusta y de gran rendimiento. Cyclone DDS se desarrolla completamente abierto como un proyecto Eclipse IoT. Consulta también: https://projects.eclipse.org/projects/iot.cyclonedds

source: Prerequisites
es: requisitos previos

source: Have `rosdep installed <https://wiki.ros.org/rosdep#Installing_rosdep>`__
es: Tener `rosdep instalado <https://wiki.ros.org/rosdep#Installing_rosdep>`__

source: Install packages
es: Instalar paquetes

source: The easiest way is to install from ROS 2 apt repository.
es: La forma más fácil es instalar desde el repositorio apt de ROS 2.

source: Build from source code
es: Compilar a partir del código fuente

source: Building from source code is also another way to install.
es: Compilar a partir del código fuente también es otra forma de instalar.

source: First, clone Cyclone DDS and rmw_cyclonedds in the ROS 2 workspace source directory.
es: Primero, clona Cyclone DDS y rmw_cyclonedds en el directorio src del espacio de trabajo de ROS 2.

source: Then, install necessary packages for Cyclone DDS.
es: Luego, instala los paquetes necesarios para Cyclone DDS.

source: Finally, run colcon build.
es: Finalmente, ejecute colcon build.

source: Switch to rmw_cyclonedds
es: Cambiar a rmw_cyclonedds

source: Switch from other rmw to rmw_cyclonedds by specifying the environment variable.
es: Cambie de otro rmw a rmw_cyclonedds especificando la variable de entorno.

source: See also: :doc:`Working with multiple RMW implementations <../../How-To-Guides/Working-with-multiple-RMW-implementations>`
es: Consulta también: :doc:`Trabajar con varias implementaciones de RMW <../../How-To-Guides/Working-with-multiple-RMW-implementations>`

source: Run the talker and listener
es: Ejecuta el talker y el listener

source: Now run ``talker`` and ``listener`` to test Cyclone DDS.
es: Ahora ejecuta ``talker`` y ``listener`` para probar Cyclone DDS.
