Repository: audrow/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Installation/Maintaining-a-Source-Checkout.po
Languages: es

source: Maintain source checkout
es: Mantener los fuentes obtenidos

source: If you have installed ROS 2 from source, there may have been changes made to the source code since the time that you checked it out. To keep your source checkout up to date, you will have to periodically update your ``ros2.repos`` file, download the latest sources, and rebuild your workspace.
es: Si instalaste ROS 2 de fuentes, es posible que se hayan realizado cambios en el código fuente desde el momento en que lo obtuviste. Para mantener actualizada los fuentes obtenidos, deberá actualizar periódicamente su archivo ``ros2.repos``, descargar las fuentes más recientes y recompilar su espacio de trabajo.

source: Update your repository list
es: Actualiza tu lista de repositorios

source: Each ROS 2 release includes a ``ros2.repos`` file that contains the list of repositories and their version for that release.
es: Cada versión de ROS 2 incluye un archivo ``ros2.repos`` que contiene la lista de repositorios y su versión para esa versión.

source: Latest ROS 2 Rolling branches
es: Ramas más recientes de ROS 2 Rolling

source: If you wish to checkout the latest code for ROS 2 Rolling, you can get the relevant repository list by running:
es: Si deseas obtener el código más reciente para ROS 2 Rolling, puedes obtener la lista de repositorios correspondiente ejecutando:

source: Update your repositories
es: Actualiza tus repositorios

source: You will notice that in the `ros2.repos <https://raw.githubusercontent.com/ros2/ros2/rolling/ros2.repos>`__ file, each repository has a ``version`` associated with it that points to a particular commit hash, tag, or branch name. It is possible that these versions refer to new tags/branches that your local copy of the repositories will not recognize as they are out-of-date. Because of this, you should update the repositories that you have already checked out with the following command:
es: Notará que en el archivo `ros2.repos <https://raw.githubusercontent.com/ros2/ros2/rolling/ros2.repos>`__, cada repositorio tiene una ``versión`` asociada que apunta a un hash de commit, etiqueta o nombre de rama en particular. Es posible que estas versiones se refieran a nuevas etiquetas/ramas que tu copia local de los repositorios no reconocerá porque están desactualizadas. Debido a esto, debes actualizar los repositorios que ya has obtenido con el siguiente comando:

source: Download the new source code
es: Descarga el nuevo código fuente

source: You should now be able to download the sources associated with the new repository list with:
es: Ahora deberías poder descargar las fuentes asociadas con la nueva lista de repositorios con:

source: Rebuild your workspace
es: Reocmpila tu worskpace

source: Now that the workspace is up to date with the latest sources, remove your previous install and rebuild your workspace with, for example:
es: Ahora que el workspace está actualizado con las fuentes más recientes, elimina tu instalación anterior y recompila tu espacio de trabajo con, por ejemplo:

source: Inspect your source checkout
es: Inspecciona tus fuentes obtenidas

source: During your development you may have deviated from the original state of your workspace from when you imported the repository list. If you wish to know the versions of the set of repositories in your workspace, you can export the information using the following command:
es: Durante tu desarrollo, es posible que se haya desviado del estado original de tu workspacec cuando importaste la lista de repositorios. Si deseas conocer las versiones del conjunto de repositorios en tu workspace, puedes exportar la información mediante el siguiente comando:

source: This ``my_ros2.repos`` file can then be shared with others so that they can reproduce the state of the repositories in your workspace.
es: Este archivo ``my_ros2.repos`` se puede compartir con otros para que puedan reproducir el estado de los repositorios en tu worskpace.
